Repository: linjiefeng12-netizen/HomeCook
Catalog: HomeCook/Resources/*.lproj/Localizable.strings
Languages: es, ko, ru, zh_hans

# privacy_policy_content
source: HomeCook Privacy Policy We value your privacy and this policy explains how we collect, use, and protect your information. 1. Information Collection We may collect your device information, usage data, and preference settings to improve the app experience. 2. Information Usage Collected information is used only for: - Providing and improving services - Personalized recommendations - Technical support 3. Information Protection We use industry-standard security measures to protect your data. 4. Third-party Services We may use third-party analytics tools, which have their own privacy policies. 5. Contact Us If you have questions about the privacy policy, please contact us through the in-app feedback feature. Last updated: January 2025
es: Política de privacidad de HomeCook Valoramos tu privacidad y esta política explica cómo recopilamos, usamos y protegemos tu información. 1. Recopilación de información Podemos recopilar información de tu dispositivo, datos de uso y configuraciones para mejorar la experiencia de la app. 2. Uso de la información La información recopilada se usa solo para: - Proporcionar y mejorar servicios - Recomendaciones personalizadas - Soporte técnico 3. Protección de la información Usamos medidas de seguridad estándar de la industria para proteger tus datos. 4. Servicios de terceros Podemos usar herramientas de análisis de terceros que tienen sus propias políticas de privacidad. 5. Contáctanos Si tienes preguntas sobre nuestra política de privacidad, por favor contáctanos a través de la función de comentarios en la app. Última actualización: Enero 2025
ko: HomeCook 개인정보 처리방침 저희는 귀하의 개인정보를 소중히 여기며, 이 정책은 저희가 어떻게 정보를 수집, 사용, 보호하는지 설명합니다. 1. 정보 수집 앱 경험을 개선하기 위해 기기 정보, 사용 데이터, 설정을 수집할 수 있습니다. 2. 정보 사용 수집된 정보는 다음 목적으로만 사용됩니다: - 서비스 제공 및 개선 - 개인화된 추천 - 기술 지원 3. 정보 보호 업계 표준 보안 조치를 채택하여 데이터를 보호합니다. 4. 제3자 서비스 자체 개인정보 처리방침을 가진 제3자 분석 도구를 사용할 수 있습니다. 5. 문의하기 개인정보 처리방침에 대한 질문이 있으시면 앱 내 피드백 기능을 통해 문의해 주세요. 최종 업데이트: 2025년 1월
ru: Политика конфиденциальности HomeCook Мы ценим вашу конфиденциальность, и эта политика объясняет, как мы собираем, используем и защищаем вашу информацию. 1. Сбор информации Мы можем собирать информацию о вашем устройстве, данные об использовании и настройки для улучшения работы приложения. 2. Использование информации Собранная информация используется только для: - Предоставления и улучшения услуг - Персонализированных рекомендаций - Технической поддержки 3. Защита информации Мы используем стандартные отраслевые меры безопасности для защиты ваших данных. 4. Сторонние сервисы Мы можем использовать сторонние аналитические инструменты, которые имеют свои собственные политики конфиденциальности. 5. Связаться с нами Если у вас есть вопросы о нашей политике конфиденциальности, пожалуйста, свяжитесь с нами через функцию обратной связи в приложении. Последнее обновление: Январь 2025
zh_hans: HomeCook 隐私政策 我们重视您的隐私，本政策说明我们如何收集、使用和保护您的信息。 1. 信息收集 我们可能收集您的设备信息、使用数据和偏好设置，以改善应用体验。 2. 信息使用 收集的信息仅用于： - 提供和改善服务 - 个性化推荐 - 技术支持 3. 信息保护 我们采用行业标准的安全措施保护您的数据。 4. 第三方服务 我们可能使用第三方分析工具，这些服务有自己的隐私政策。 5. 联系我们 如对隐私政策有疑问，请通过应用内反馈功能联系我们。 最后更新：2025年1月

# open_source_licenses_content
source: HomeCook uses the following open source components: SwiftUI Copyright © Apple Inc. License: Apple Software License Foundation Copyright © Apple Inc. License: Apple Software License Thanks to all open source contributors whose hard work made this app possible. For more information, please visit the official websites of each component.
es: HomeCook usa los siguientes componentes de código abierto: SwiftUI Copyright © Apple Inc. Licencia: Apple Software License Foundation Copyright © Apple Inc. Licencia: Apple Software License Gracias a todos los contribuidores de código abierto cuyo arduo trabajo hizo posible esta app. Para más información, por favor visita los sitios web oficiales de cada componente.
ko: HomeCook은 다음 오픈소스 구성 요소를 사용합니다: SwiftUI 저작권 © Apple Inc. 라이선스: Apple Software License Foundation 저작권 © Apple Inc. 라이선스: Apple Software License 이 앱을 가능하게 해준 모든 오픈소스 기여자들의 노고에 감사드립니다. 자세한 정보는 각 구성 요소의 공식 웹사이트를 참조하세요.
ru: HomeCook использует следующие компоненты с открытым исходным кодом: SwiftUI Copyright © Apple Inc. Лицензия: Apple Software License Foundation Copyright © Apple Inc. Лицензия: Apple Software License Спасибо всем участникам проектов с открытым исходным кодом, чья упорная работа сделала это приложение возможным. Для получения дополнительной информации посетите официальные веб-сайты каждого компонента.
zh_hans: HomeCook 使用了以下开源组件： SwiftUI 版权所有 © Apple Inc. 许可证：Apple Software License Foundation 版权所有 © Apple Inc. 许可证：Apple Software License 感谢所有开源贡献者的辛勤工作，使得这个应用成为可能。 如需了解更多信息，请访问各组件的官方网站。

source: Favorited
es: Añadido a favoritos
ko: 즐겨찾기에 추가됨
ru: Добавлено в избранное
zh_hans: 已收藏

source: Unfavorited
es: Eliminado de favoritos
ko: 즐겨찾기에서 제거됨
ru: Удалено из избранного
zh_hans: 已取消收藏

source: No Favorites
es: Sin favoritos
ko: 즐겨찾기가 없습니다
ru: Нет избранных
zh_hans: 暂无收藏

# no_favorites_description
source: Tap the heart icon on video cards to favorite your preferred recipe videos
es: Toca el ícono de corazón en las tarjetas de video para guardar tus videos de recetas favoritos
ko: 비디오 카드의 하트 아이콘을 클릭하여 좋아하는 레시피 비디오를 저장하세요
ru: Нажмите на значок сердца на видеокартах, чтобы сохранить ваши любимые видео рецептов
zh_hans: 点击视频卡片上的红心图标来收藏您喜欢的食谱视频

source: views
es: visualizaciones
ko: 회 시청
ru: просмотров
zh_hans: 次观看

# favorite_count
source: %d favorites
es: %d favoritos en total
ko: 총 %d개의 즐겨찾기
ru: Всего %d избранных
zh_hans: 共%d个收藏

# favorite_time
source: Favorited on %@
es: Añadido a favoritos el %@
ko: %@에 즐겨찾기에 추가
ru: Добавлено в избранное %@
zh_hans: 收藏于%@

# search_recipes
source: Search Cooking Videos
es: Buscar recetas
ko: 레시피 검색
ru: Поиск рецептов
zh_hans: 搜索烹饪视频

source: Searching videos...
es: Buscando videos...
ko: 동영상 검색 중...
ru: Поиск видео...
zh_hans: 正在搜索视频...

# based_on_selection
source: Based on your selected ingredients and kitchenware
es: Basado en la selección
ko: 선택에 기반하여
ru: На основе выбора
zh_hans: 基于您选择的食材和厨具

# please_select_first
source: Please select ingredients or kitchenware first
es: Por favor selecciona ingredientes primero
ko: 먼저 재료를 선택해주세요
ru: Пожалуйста, сначала выберите ингредиенты
zh_hans: 请先选择食材或厨具

# no_videos_found
source: No related cooking videos found
es: No se encontraron videos
ko: 동영상을 찾을 수 없습니다
ru: Видео не найдены
zh_hans: 未找到相关烹饪视频

# try_other_ingredients
source: Please try selecting other ingredients or kitchenware
es: Prueba otros ingredientes
ko: 다른 재료를 시도해보세요
ru: Попробуйте другие ингредиенты
zh_hans: 请尝试选择其他食材或厨具

source: Searching cooking videos...
es: Buscando videos de cocina...
ko: 요리 동영상 검색 중...
ru: Поиск кулинарных видео...
zh_hans: 正在搜索烹饪视频...

# try_random_match_again
source: Please try random match again
es: Prueba la combinación aleatoria de nuevo
ko: 랜덤 매치를 다시 시도해보세요
ru: Попробуйте случайное совпадение снова
zh_hans: 请再次尝试随机匹配

# searching_for_recipes
source: Searching for delicious recipes...
es: Buscando recetas...
ko: 레시피 검색 중...
ru: Поиск рецептов...
zh_hans: 正在搜索美味食谱...

# welcome_subtitle
source: Delicious cooking starts here
es: La cocina deliciosa comienza aquí
ko: 맛있는 요리가 여기서 시작됩니다
ru: Вкусная готовка начинается здесь
zh_hans: 美味烹饪，从这里开始

# welcome_loading_text
source: Preparing your culinary experience...
es: Preparando tu experiencia culinaria...
ko: 요리 경험을 준비하고 있습니다...
ru: Подготавливаем ваш кулинарный опыт...
zh_hans: 正在准备美味体验...

# welcome_loading
source: Preparing your culinary experience...
es: Preparando tu experiencia culinaria...
ko: 요리 경험을 준비하고 있습니다...
ru: Подготавливаем ваш кулинарный опыт...
zh_hans: 正在准备美味体验...

source: Premium
ko: 프리미엄
ru: Премиум
zh_hans: 高级会员

# premium_subtitle
source: Unlock all features and enjoy the complete cooking experience
es: Desbloquea todas las funciones y disfruta de la experiencia culinaria completa
ko: 모든 기능을 잠금 해제하고 완전한 요리 경험을 즐기세요
ru: Разблокируйте все функции и наслаждайтесь полным кулинарным опытом
zh_hans: 解锁所有功能，享受完整的烹饪体验

source: Change Avatar
es: Cambiar avatar
ko: 아바타 변경
ru: Изменить аватар
zh_hans: 更换头像

source: Choose Photo
es: Elegir foto
ko: 사진 선택
ru: Выбрать фото
zh_hans: 选择照片

source: Take Photo
es: Tomar foto
ko: 사진 촬영
ru: Сделать фото
zh_hans: 拍照

source: Cancel
es: Cancelar
ko: 취소
ru: Отмена
zh_hans: 取消

source: Login
es: Iniciar sesión
ko: 로그인
ru: Вход
zh_hans: 登录

source: Register
es: Registrarse
ko: 회원가입
ru: Регистрация
zh_hans: 注册

# login_subtitle
source: Welcome back! Please sign in to your account
es: ¡Bienvenido de vuelta! Por favor inicia sesión en tu cuenta
ko: 다시 오신 것을 환영합니다! 계정에 로그인해 주세요
ru: Добро пожаловать обратно! Пожалуйста, войдите в свой аккаунт
zh_hans: 欢迎回来！请登录您的账户

# register_subtitle
source: Create a new account to start your cooking journey
es: Crea una nueva cuenta para comenzar tu viaje culinario
ko: 새 계정을 만들어 요리 여행을 시작하세요
ru: Создайте новый аккаунт, чтобы начать свое кулинарное путешествие
zh_hans: 创建新账户开始您的烹饪之旅

source: Full Name
es: Nombre completo
ko: 이름
ru: Полное имя
zh_hans: 姓名

source: Email
es: Correo electrónico
ko: 이메일
ru: Электронная почта
zh_hans: 邮箱

source: Password
es: Contraseña
ko: 비밀번호
ru: Пароль
zh_hans: 密码

source: Confirm Password
es: Confirmar contraseña
ko: 비밀번호 확인
ru: Подтвердить пароль
zh_hans: 确认密码

# no_account
source: Don't have an account?
es: ¿No tienes cuenta?
ko: 계정이 없으신가요?
ru: Нет аккаунта?
zh_hans: 还没有账户？

# have_account
source: Already have an account?
es: ¿Ya tienes cuenta?
ko: 이미 계정이 있으신가요?
ru: Уже есть аккаунт?
zh_hans: 已有账户？

source: Notice
es: Aviso
ko: 알림
ru: Уведомление
zh_hans: 提示

# login_failed
source: Login failed, please check your email and password
zh_hans: 登录失败，请检查邮箱和密码

# password_mismatch
source: Passwords do not match
es: Las contraseñas no coinciden
ko: 비밀번호가 일치하지 않습니다
ru: Пароли не совпадают
zh_hans: 两次输入的密码不一致

# password_too_short
source: Password must be at least 6 characters long
es: La contraseña debe tener al menos 6 caracteres
ko: 비밀번호는 최소 6자 이상이어야 합니다
ru: Пароль должен содержать не менее 6 символов
zh_hans: 密码长度至少6位

# invalid_email
source: Invalid email format
zh_hans: 邮箱格式不正确

# email_already_exists
source: This email is already registered
zh_hans: 该邮箱已被注册

source: Logout
es: Cerrar sesión
ko: 로그아웃
ru: Выход
zh_hans: 退出登录

source: Processing...
es: Procesando...
ko: 처리 중...
ru: Обработка...
zh_hans: 处理中...

source: Welcome back
es: Bienvenido de vuelta
ko: 다시 오신 것을 환영합니다
ru: Добро пожаловать обратно
zh_hans: 欢迎回来

# create_new_account
source: Create a new account
es: Crear nueva cuenta
ko: 새 계정 만들기
ru: Создать новый аккаунт
zh_hans: 创建新账户

# already_have_account
source: Already have an account?
es: ¿Ya tienes cuenta?
ko: 이미 계정이 있으신가요?
ru: Уже есть аккаунт?
zh_hans: 已有账户？

# dont_have_account
source: Don't have an account?
es: ¿No tienes cuenta?
ko: 계정이 없으신가요?
ru: Нет аккаунта?
zh_hans: 还没有账户？

# login_failed_message
source: Login failed, please check your email and password
es: Error al iniciar sesión. Por favor verifica tu correo y contraseña
ko: 로그인에 실패했습니다. 이메일과 비밀번호를 확인해 주세요
ru: Ошибка входа. Пожалуйста, проверьте вашу почту и пароль
zh_hans: 登录失败，请检查邮箱和密码

# registration_failed_message
source: Registration failed, this email may already be registered
es: Error en el registro. Este correo podría ya estar registrado
ko: 회원가입에 실패했습니다. 이 이메일은 이미 등록되어 있을 수 있습니다
ru: Ошибка регистрации. Эта почта может быть уже зарегистрирована
zh_hans: 注册失败，该邮箱可能已被注册

# passwords_dont_match
source: Passwords do not match
es: Las contraseñas no coinciden
ko: 비밀번호가 일치하지 않습니다
ru: Пароли не совпадают
zh_hans: 两次输入的密码不一致

# password_min_length
source: Password must be at least 6 characters
es: La contraseña debe tener al menos 6 caracteres
ko: 비밀번호는 최소 6자 이상이어야 합니다
ru: Пароль должен содержать не менее 6 символов
zh_hans: 密码长度至少6位

# invalid_email_format
source: Please enter a valid email address
es: Por favor ingresa una dirección de correo válida
ko: 유효한 이메일 주소를 입력해 주세요
ru: Пожалуйста, введите действительный адрес электронной почты
zh_hans: 请输入有效的邮箱地址

# alert_title
source: Notice
es: Aviso
ko: 알림
ru: Уведомление
zh_hans: 提示

# alert_ok
source: OK
ko: 확인
zh_hans: 确定

# choose_plan
source: Choose Your Plan
es: Elegir plan de suscripción
ko: 구독 플랜 선택
ru: Выбрать план подписки
zh_hans: 选择订阅套餐

# free_trial_title
source: Free Trial
es: Prueba gratuita
ko: 무료 체험
ru: Бесплатная пробная версия
zh_hans: 免费试用

# half_year_title
source: 6-Month Plan
es: Suscripción 6 meses
ko: 6개월 구독
ru: Подписка на 6 месяцев
zh_hans: 半年订阅

# full_year_title
source: Annual Plan
es: Suscripción 1 año
ko: 1년 구독
ru: Подписка на 1 год
zh_hans: 全年订阅

source: Free
es: Gratis
ko: 무료
ru: Бесплатно
zh_hans: 免费

# one_month
source: 1 month
es: 1 mes
ko: 1개월
ru: 1 месяц
zh_hans: 1个月

# six_months
source: 6 months
es: 6 meses
ko: 6개월
ru: 6 месяцев
zh_hans: 6个月

# one_year
source: 1 year
es: 1 año
ko: 1년
ru: 1 год
zh_hans: 1年

source: Best Value
es: Mejor valor
ko: 최고 가치
ru: Лучшая цена
zh_hans: 最超值

source: Start Free Trial
es: Iniciar prueba gratuita
ko: 무료 체험 시작
ru: Начать бесплатную пробную версию
zh_hans: 开始免费试用

# subscribe
source: Subscribe Now
es: Suscribirse ahora
ko: 지금 구독
ru: Подписаться сейчас
zh_hans: 立即订阅

# subscription_terms
source: Subscription auto-renews, cancel anytime in settings
es: La suscripción se renueva automáticamente y puede cancelarse en cualquier momento en configuración
ko: 구독은 자동 갱신되며 설정에서 언제든지 취소할 수 있습니다
ru: Подписка автоматически продлевается и может быть отменена в любое время в настройках
zh_hans: 订阅将自动续费，可随时在设置中取消

source: Close
es: Cerrar
ko: 닫기
ru: Закрыть
zh_hans: 关闭

# subscription_success
source: Subscription Successful
es: Suscripción exitosa
ko: 구독 성공
ru: Подписка успешна
zh_hans: 订阅成功

# free_trial_activated
source: Free trial activated! You can use premium features for 1 month for free.
es: ¡Prueba gratuita activada! Puedes usar las funciones premium gratis durante 1 mes.
ko: 무료 체험이 활성화되었습니다! 1개월 동안 프리미엄 기능을 무료로 사용할 수 있습니다.
ru: Бесплатная пробная версия активирована! Вы можете использовать премиум функции бесплатно в течение 1 месяца.
zh_hans: 免费试用已激活！您可以免费使用1个月的高级功能。

# half_year_subscribed
source: 6-month subscription activated! Thank you for your support.
es: ¡Suscripción de 6 meses activada! Gracias por tu apoyo.
ko: 6개월 구독이 활성화되었습니다! 지원해 주셔서 감사합니다.
ru: Подписка на 6 месяцев активирована! Спасибо за вашу поддержку.
zh_hans: 半年订阅已激活！感谢您的支持。

# full_year_subscribed
source: Annual subscription activated! Thank you for choosing our best value plan.
es: ¡Suscripción de 1 año activada! Gracias por elegir nuestro plan de mejor valor.
ko: 1년 구독이 활성화되었습니다! 최고 가치 플랜을 선택해 주셔서 감사합니다.
ru: Подписка на 1 год активирована! Спасибо за выбор нашего плана с лучшей ценой.
zh_hans: 全年订阅已激活！感谢您选择我们的最超值套餐。

source: OK
ko: 확인
zh_hans: 好的

# registration_failed
source: Registration failed, please try again later
es: Error en el registro. Por favor inténtalo más tarde
ko: 회원가입에 실패했습니다. 나중에 다시 시도해 주세요
ru: Ошибка регистрации. Пожалуйста, попробуйте позже
zh_hans: 注册失败，请稍后重试

# login_error
source: Invalid email or password
es: Correo o contraseña inválidos
ko: 잘못된 이메일 또는 비밀번호입니다
ru: Неверная почта или пароль
zh_hans: 邮箱或密码错误

# network_error
source: Network connection failed, please check your network settings
es: Error de conexión de red. Por favor verifica tu configuración de red
ko: 네트워크 연결에 실패했습니다. 네트워크 설정을 확인해 주세요
ru: Ошибка сетевого соединения. Пожалуйста, проверьте настройки сети
zh_hans: 网络连接失败，请检查网络设置

# server_error
source: Server error, please try again later
es: Error del servidor. Por favor inténtalo más tarde
ko: 서버 오류가 발생했습니다. 나중에 다시 시도해 주세요
ru: Ошибка сервера. Пожалуйста, попробуйте позже
zh_hans: 服务器错误，请稍后重试

# unknown_error
source: An unknown error occurred, please try again later
es: Ocurrió un error desconocido. Por favor inténtalo más tarde
ko: 알 수 없는 오류가 발생했습니다. 나중에 다시 시도해 주세요
ru: Произошла неизвестная ошибка. Пожалуйста, попробуйте позже
zh_hans: 发生未知错误，请稍后重试

# email_already_registered
source: This email is already registered
es: Este correo ya está registrado
ko: 이 이메일은 이미 등록되어 있습니다
ru: Эта почта уже зарегистрирована
zh_hans: 该邮箱已被注册

# invalid_credentials
source: Invalid email or password
es: Correo o contraseña inválidos
ko: 잘못된 이메일 또는 비밀번호입니다
ru: Неверная почта или пароль
zh_hans: 邮箱或密码错误

# user_not_found
source: Account not found or password incorrect
es: Cuenta no encontrada o contraseña incorrecta
ko: 계정을 찾을 수 없거나 비밀번호가 틀렸습니다
ru: Аккаунт не найден или неверный пароль
zh_hans: 无此账号或密码错误

# email_not_confirmed
source: Email not verified, please check your email and click the verification link
es: Correo no confirmado. Por favor verifica tu correo y haz clic en el enlace de verificación
ko: 이메일이 인증되지 않았습니다. 이메일을 확인하고 인증 링크를 클릭해 주세요
ru: Почта не подтверждена. Пожалуйста, проверьте вашу почту и нажмите на ссылку подтверждения
zh_hans: 邮箱未验证，请检查邮箱并点击验证链接

# weak_password
source: Password is too weak, please use a more complex password
es: La contraseña es muy débil. Por favor usa una contraseña más compleja
ko: 비밀번호가 너무 약합니다. 더 복잡한 비밀번호를 사용해 주세요
ru: Пароль слишком слабый. Пожалуйста, используйте более сложный пароль
zh_hans: 密码强度太弱，请使用更复杂的密码

# too_many_requests
source: Too many requests, please try again later
es: Demasiadas solicitudes. Por favor inténtalo más tarde
ko: 요청이 너무 많습니다. 나중에 다시 시도해 주세요
ru: Слишком много запросов. Пожалуйста, попробуйте позже
zh_hans: 请求过于频繁，请稍后重试

# search_combination_hint
source: Will search %d×%d=%d combinations
es: Buscando %d×%d=%d combinaciones
ko: %d×%d=%d 조합을 검색합니다
ru: Поиск %d×%d=%d комбинаций
zh_hans: 将搜索 %d×%d=%d 种组合

# search_combination_result_title
source: Search Combination Results
es: Resultados de combinación de búsqueda
ko: 검색 조합 결과
ru: Результаты комбинации поиска
zh_hans: 搜索组合结果

# search_combination_result
source: Found %d vegetables × %d meats = %d combinations of popular videos
es: %d verduras × %d carnes = %d combinaciones de videos populares encontradas
ko: %d가지 채소 × %d가지 고기 = %d가지 조합의 인기 동영상을 찾았습니다
ru: %d овощей × %d мяса = %d комбинаций популярных видео найдено
zh_hans: 为您找到 %d 种蔬菜 × %d 种肉类 = %d 种组合的热门视频

source: No related cooking videos found
es: No se encontraron videos de cocina relacionados
ko: 관련 요리 동영상을 찾을 수 없습니다
ru: Связанные кулинарные видео не найдены
zh_hans: 未找到相关烹饪视频

# please_try_selecting_other_ingredients
source: Please try selecting other ingredients or kitchenware
es: Por favor intenta seleccionar otros ingredientes o utensilios de cocina
ko: 다른 재료나 주방용품을 선택해 보세요
ru: Пожалуйста, попробуйте выбрать другие ингредиенты или кухонную утварь
zh_hans: 请尝试选择其他食材或厨具
