Repository: linjiefeng12-netizen/HomeCook
Catalog: HomeCook/Resources/*.lproj/Localizable.strings
Languages: es, ko, ru, zh_hans

source: Home
es: Inicio
ko: 홈
ru: Главная
zh_hans: 首页

source: Flavor Gacha
es: Gacha de Sabores
ko: 맛 가챠
ru: Гача вкусов
zh_hans: 风味抽卡

source: Me
es: Perfil
ko: 내 정보
ru: Профиль
zh_hans: 我的

# lets_cooking
source: Let's Cook!
es: ¡Cocinemos!
ko: 요리를 시작해요!
ru: Давайте готовить!
zh_hans: 开始烹饪吧！

source: Select Ingredients
es: Seleccionar ingredientes
ko: 재료 선택
ru: Выбрать ингредиенты
zh_hans: 选择食材

source: Vegetables
es: Verduras
ko: 채소
ru: Овощи
zh_hans: 蔬菜

source: Meats
es: Carnes
ko: 육류
ru: Мясо
zh_hans: 肉类

# staple_foods
source: Staple Foods (Options)
es: Alimentos básicos (opcional)
ko: 주식 (선택사항)
ru: Основные продукты (опционально)
zh_hans: 主食（可选）

source: Select Kitchenware
es: Seleccionar utensilios
ko: 조리도구 선택
ru: Выбрать кухонную утварь
zh_hans: 选择厨具

source: Recommended Recipes
es: Recetas recomendadas
ko: 추천 레시피
ru: Рекомендуемые рецепты
zh_hans: 推荐食谱

source: Potato
es: Patata
ko: 감자
ru: Картофель
zh_hans: 土豆

source: Carrot
es: Zanahoria
ko: 당근
ru: Морковь
zh_hans: 胡萝卜

source: Tomato
es: Tomate
ko: 토마토
ru: Помидор
zh_hans: 番茄

source: Onion
es: Cebolla
ko: 양파
ru: Лук
zh_hans: 洋葱

source: Green Pepper
es: Pimiento verde
ko: 피망
ru: Зеленый перец
zh_hans: 青椒

source: Eggplant
es: Berenjena
ko: 가지
ru: Баклажан
zh_hans: 茄子

source: Spinach
es: Espinacas
ko: 시금치
ru: Шпинат
zh_hans: 菠菜

source: Cucumber
es: Pepino
ko: 오이
ru: Огурец
zh_hans: 黄瓜

source: Sweet Corn
es: Maíz dulce
ko: 옥수수
ru: Сладкая кукуруза
zh_hans: 甜玉米

source: Celery
es: Apio
ko: 셀러리
ru: Сельдерей
zh_hans: 芹菜

source: Cauliflower
es: Coliflor
ko: 콜리플라워
ru: Цветная капуста
zh_hans: 花菜

source: Broccoli
es: Brócoli
ko: 브로콜리
ru: Брокколи
zh_hans: 西兰花

source: Bitter Melon
es: Melón amargo
ko: 여주
ru: Горькая дыня
zh_hans: 苦瓜

source: Pumpkin
es: Calabaza
ko: 호박
ru: Тыква
zh_hans: 南瓜

source: Lotus Root
es: Raíz de loto
ko: 연근
ru: Корень лотоса
zh_hans: 莲藕

source: Mushrooms
es: Setas
ko: 버섯
ru: Грибы
zh_hans: 蘑菇

source: Enoki Mushrooms
es: Setas enoki
ko: 팽이버섯
ru: Грибы эноки
zh_hans: 金针菇

source: Shiitake Mushrooms
es: Setas shiitake
ko: 표고버섯
ru: Грибы шиитаке
zh_hans: 香菇

source: Oyster Mushrooms
es: Setas ostra
ko: 느타리버섯
ru: Вешенки
zh_hans: 平菇

source: King Oyster Mushrooms
es: Setas rey ostra
ko: 새송이버섯
ru: Королевские вешенки
zh_hans: 杏鲍菇

source: Sausage
es: Salchicha
ko: 소시지
ru: Колбаса
zh_hans: 香肠

source: Pork
es: Cerdo
ko: 돼지고기
ru: Свинина
zh_hans: 猪肉

source: Beef
es: Ternera
ko: 소고기
ru: Говядина
zh_hans: 牛肉

source: Eggs
es: Huevos
ko: 계란
ru: Яйца
zh_hans: 鸡蛋

source: Fish
es: Pescado
ko: 생선
ru: Рыба
zh_hans: 鱼

source: Shrimp
es: Gambas
ko: 새우
ru: Креветки
zh_hans: 虾

source: Chicken
es: Pollo
ko: 닭고기
ru: Курица
zh_hans: 鸡肉

source: Lamb
es: Cordero
ko: 양고기
ru: Баранина
zh_hans: 羊肉

source: Duck
es: Pato
ko: 오리고기
ru: Утка
zh_hans: 鸭肉

source: Goose
es: Ganso
ko: 거위고기
ru: Гусь
zh_hans: 鹅肉

source: Offal
es: Vísceras
ko: 내장
ru: Субпродукты
zh_hans: 内脏

source: Tripe
es: Callos
ko: 곱창
ru: Рубец
zh_hans: 牛肚

source: Pasta
ko: 파스타
ru: Паста
zh_hans: 意面

source: Bread
es: Pan
ko: 빵
ru: Хлеб
zh_hans: 面包

source: Rice
es: Arroz
ko: 밥
ru: Рис
zh_hans: 米饭

source: Noodles
es: Fideos
ko: 면
ru: Лапша
zh_hans: 面条

source: Rice Flour
es: Harina de arroz
ko: 쌀가루
ru: Рисовая мука
zh_hans: 米粉

source: Grains
es: Cereales
ko: 곡물
ru: Крупы
zh_hans: 谷物

source: Beans
es: Judías
ko: 콩류
ru: Бобы
zh_hans: 豆类

source: Bean Products
es: Productos de judías
ko: 콩 제품
ru: Бобовые продукты
zh_hans: 豆制品

source: Tubers
es: Tubérculos
ko: 덩이줄기
ru: Клубни
zh_hans: 薯类

source: Nuts
es: Frutos secos
ko: 견과류
ru: Орехи
zh_hans: 坚果

source: Oven
es: Horno
ko: 오븐
ru: Духовка
zh_hans: 烤箱

source: Air Fryer
es: Freidora de aire
ko: 에어프라이어
ru: Аэрофритюрница
zh_hans: 空气炸锅

source: Microwave
es: Microondas
ko: 전자레인지
ru: Микроволновка
zh_hans: 微波炉

source: Rice Cooker
es: Arrocera
ko: 밥솥
ru: Рисоварка
zh_hans: 电饭煲

source: Versatile Pot
es: Olla versátil
ko: 다용도 냄비
ru: Универсальная кастрюля
zh_hans: 多功能锅

source: Servings
es: Porciones
ko: 인분
ru: Порции
zh_hans: 人数

source: Random Match
es: Combinación aleatoria
ko: 랜덤 매치
ru: Случайное совпадение
zh_hans: 随机匹配

source: Recipes
es: Recetas
ko: 레시피
ru: Рецепты
zh_hans: 食谱

# click_random_match
source: Click Random Match to get recipe recommendations
es: Haz clic en Combinación aleatoria para recomendaciones de recetas
ko: 랜덤 매치를 클릭하여 레시피 추천 받기
ru: Нажмите Случайное совпадение для рекомендаций рецептов
zh_hans: 点击随机匹配获取食谱推荐

source: Dessert
es: Postre
ko: 디저트
ru: Десерт
zh_hans: 甜品

source: Pasta Carbonara
ko: 카르보나라 파스타
ru: Паста Карбонара
zh_hans: 奶油培根意面

source: Mediterranean Salad
es: Ensalada mediterránea
ko: 지중해 샐러드
ru: Средиземноморский салат
zh_hans: 地中海沙拉

source: Tomato Soup
es: Sopa de tomate
ko: 토마토 수프
ru: Томатный суп
zh_hans: 番茄汤

source: Chocolate Mousse
es: Mousse de chocolate
ko: 초콜릿 무스
ru: Шоколадный мусс
zh_hans: 巧克力慕斯

source: Roasted Potato Pork
es: Patatas asadas con cerdo
ko: 구운 감자 돼지고기
ru: Жареный картофель со свининой
zh_hans: 烤土豆猪肉

source: Rice Cooker Chicken Rice
es: Arroz con pollo de arrocera
ko: 밥솥 치킨라이스
ru: Куриный рис из рисоварки
zh_hans: 电饭煲鸡肉饭

source: Profile
es: Perfil
ko: 프로필
ru: Профиль
zh_hans: 个人资料

source: Premium Member
es: Miembro Premium
ko: 프리미엄 회원
ru: Премиум участник
zh_hans: 高级会员

# joined_years_ago
source: Joined %d years ago
es: Se unió hace %d años
ko: %d년 전 가입
ru: Присоединился %d лет назад
zh_hans: 加入%d年前

source: History
es: Historial
ko: 기록
ru: История
zh_hans: 历史记录

source: My Favorites
es: Mis favoritos
ko: 내 즐겨찾기
ru: Мои избранные
zh_hans: 我的收藏

source: Share Recipes
es: Compartir recetas
ko: 레시피 공유
ru: Поделиться рецептами
zh_hans: 分享食谱

source: Feedback
es: Comentarios
ko: 피드백
ru: Отзыв
zh_hans: 反馈

source: Settings
es: Configuración
ko: 설정
ru: Настройки
zh_hans: 设置

source: About
es: Acerca de la app
ko: 앱 정보
ru: О приложении
zh_hans: 关于

source: Spicy Chicken Stir-Fry
es: Salteado de pollo picante
ko: 매운 치킨 볶음
ru: Острая жареная курица
zh_hans: 香辣鸡肉炒

source: Creamy Tomato Soup
es: Sopa cremosa de tomate
ko: 크림 토마토 수프
ru: Кремовый томатный суп
zh_hans: 奶油番茄汤

# grilled_salmon_asparagus
source: Grilled Salmon with Asparagus
es: Salmón a la parrilla con espárragos
ko: 아스파라거스 구운 연어
ru: Жареный лосось со спаржей
zh_hans: 芦笋烤三文鱼

# classic_combination_potatoes_pork
source: Classic combination of potatoes and pork
es: Combinación clásica de patatas y cerdo
ko: 감자와 돼지고기의 클래식 조합
ru: Классическое сочетание картофеля и свинины
zh_hans: 土豆和猪肉的经典组合

# simple_quick_one_pot_meal
source: Simple and quick one-pot meal
es: Comida rápida y sencilla en una olla
ko: 간단하고 빠른 원팟 요리
ru: Простое и быстрое блюдо в одной кастрюле
zh_hans: 简单快手的一锅饭

source: November 2024
es: Noviembre 2024
ko: 2024년 11월
ru: Ноябрь 2024
zh_hans: 2024年11月

# year_month
source: November 2024
es: Noviembre 2024
ko: 2024년 11월
ru: Ноябрь 2024
zh_hans: 2024年11月

# recently_cooking
source: Recently Cooked
es: Cocinado recientemente
ko: 최근 요리
ru: Недавно готовили
zh_hans: 最近制作

# settings_title
source: Settings
es: Configuración
ko: 설정
ru: Настройки
zh_hans: 设置

source: Language Settings
es: Configuración de idioma
ko: 언어 설정
ru: Настройки языка
zh_hans: 语言设置

source: Theme Settings
es: Configuración de tema
ko: 테마 설정
ru: Настройки темы
zh_hans: 主题设置

source: Dark Mode
es: Modo oscuro
ko: 다크 모드
ru: Темный режим
zh_hans: 深色模式

source: Light Mode
es: Modo claro
ko: 라이트 모드
ru: Светлый режим
zh_hans: 浅色模式

source: About Us
es: Acerca de nosotros
ko: 우리에 대해
ru: О нас
zh_hans: 关于我们

source: User Agreement
es: Acuerdo de usuario
ko: 사용자 약관
ru: Пользовательское соглашение
zh_hans: 用户协议

source: Privacy Policy
es: Política de privacidad
ko: 개인정보 처리방침
ru: Политика конфиденциальности
zh_hans: 隐私政策

source: Version Info
es: Información de versión
ko: 버전 정보
ru: Информация о версии
zh_hans: 版本信息

source: All Rights Reserved
es: Todos los derechos reservados
ru: Все права защищены
zh_hans: 版权所有

# about_us_title
source: About HomeCook
es: Acerca de HomeCook
ko: HomeCook에 대해
ru: О HomeCook
zh_hans: 关于HomeCook

# about_us_description
source: HomeCook is your personal cooking assistant, designed to make home cooking simpler, more fun, and more creative. We believe everyone should enjoy delicious, healthy meals made with care in their own kitchen.
es: HomeCook es tu asistente culinario personal que tiene como objetivo hacer que cocinar en casa sea más simple, divertido y creativo. Creemos que todos deberían poder disfrutar de comidas deliciosas y saludables preparadas con amor en su propia cocina.
ko: HomeCook은 가정 요리를 더 간단하고 재미있고 창의적으로 만드는 것을 목표로 하는 개인 요리 도우미입니다. 모든 사람이 자신의 부엌에서 정성스럽게 만든 맛있고 건강한 식사를 즐길 수 있어야 한다고 믿습니다.
ru: HomeCook - ваш персональный кулинарный помощник, цель которого сделать домашнюю готовку проще, веселее и креативнее. Мы верим, что каждый должен наслаждаться вкусными и здоровыми блюдами, приготовленными с любовью на собственной кухне.
zh_hans: HomeCook是您的个人烹饪助手，旨在让家庭烹饪变得更简单、更有趣、更有创意。我们相信每个人都应该享受在自己厨房里用心制作的美味健康餐点。

# feature1
source: Smart Recipe Recommendations
es: Recomendaciones inteligentes de recetas
ko: 스마트 레시피 추천
ru: Умные рекомендации рецептов
zh_hans: 智能食谱推荐

# feature1_desc
source: Get personalized recipe suggestions based on your ingredients and preferences
es: Obtén sugerencias de recetas personalizadas basadas en tus ingredientes y preferencias
ko: 재료와 선호도에 따른 개인화된 레시피 제안 받기
ru: Получайте персонализированные предложения рецептов на основе ваших ингредиентов и предпочтений
zh_hans: 根据您的食材和偏好获得个性化食谱建议

# feature2
source: Multi-language Support
es: Soporte multiidioma
ko: 다국어 지원
ru: Многоязычная поддержка
zh_hans: 多语言支持

# feature2_desc
source: Supporting 8 languages to serve users worldwide
es: Soporta 8 idiomas para servir a usuarios de todo el mundo
ko: 8개 언어를 지원하여 전 세계 사용자에게 서비스 제공
ru: Поддерживает 8 языков для пользователей по всему миру
zh_hans: 支持8种语言，为全球用户提供服务

# feature3
source: User-friendly Interface
es: Interfaz fácil de usar
ko: 사용자 친화적 인터페이스
ru: Удобный интерфейс
zh_hans: 用户友好界面

# feature3_desc
source: Intuitive design makes cooking accessible to everyone
es: Diseño intuitivo que hace que cocinar sea accesible para todos
ko: 직관적인 디자인으로 요리를 모든 사람이 접근할 수 있게 함
ru: Интуитивный дизайн делает готовку доступной для всех
zh_hans: 直观的设计让烹饪变得人人可及

# user_agreement_title
source: User Agreement
es: Acuerdo de usuario
ko: 사용자 약관
ru: Пользовательское соглашение
zh_hans: 用户协议

# agreement_section1
source: 1. Acceptance of Terms
es: 1. Aceptación de términos
ko: 1. 약관 동의
ru: 1. Принятие условий
zh_hans: 1. 条款接受

# agreement_section1_content
source: By downloading, installing, or using the HomeCook application, you agree to be bound by these terms and conditions. If you do not agree to these terms, please do not use the application.
es: Al descargar, instalar o usar la aplicación HomeCook, aceptas estar sujeto a estos términos y condiciones. Si no aceptas estos términos, por favor no uses la aplicación.
ko: HomeCook 애플리케이션을 다운로드, 설치 또는 사용함으로써 이 약관에 구속되는 것에 동의합니다. 이 약관에 동의하지 않는 경우 애플리케이션을 사용하지 마십시오.
ru: Загружая, устанавливая или используя приложение HomeCook, вы соглашаетесь соблюдать эти условия. Если вы не согласны с этими условиями, пожалуйста, не используйте приложение.
zh_hans: 通过下载、安装或使用HomeCook应用程序，您同意受这些条款和条件的约束。如果您不同意这些条款，请不要使用该应用程序。

# agreement_section2
source: 2. Use of Service
es: 2. Uso del servicio
ko: 2. 서비스 사용
ru: 2. Использование сервиса
zh_hans: 2. 服务使用

# agreement_section2_content
source: HomeCook is intended for personal, non-commercial use only. You may not use the service for any commercial purposes without our written consent.
es: HomeCook está destinado solo para uso personal y no comercial. No puedes usar el servicio para fines comerciales sin nuestro consentimiento por escrito.
ko: HomeCook은 개인적, 비상업적 용도로만 사용됩니다. 당사의 서면 동의 없이 상업적 목적으로 서비스를 사용할 수 없습니다.
ru: HomeCook предназначен только для личного, некоммерческого использования. Вы не можете использовать сервис в коммерческих целях без нашего письменного согласия.
zh_hans: HomeCook仅供个人、非商业用途使用。未经我们书面同意，您不得将服务用于任何商业目的。

# agreement_section3
source: 3. User Content
es: 3. Contenido del usuario
ko: 3. 사용자 콘텐츠
ru: 3. Пользовательский контент
zh_hans: 3. 用户内容

# agreement_section3_content
source: You retain ownership of any content you submit to the application. By submitting content, you grant us a license to use, modify, and distribute your content within the application.
es: Conservas la propiedad de cualquier contenido que envíes a la aplicación. Al enviar contenido, nos otorgas una licencia para usar, modificar y distribuir tu contenido dentro de la aplicación.
ko: 애플리케이션에 제출한 콘텐츠의 소유권을 유지합니다. 콘텐츠를 제출함으로써 애플리케이션 내에서 콘텐츠를 사용, 수정, 배포할 수 있는 라이선스를 당사에 부여합니다.
ru: Вы сохраняете право собственности на любой контент, который отправляете в приложение. Отправляя контент, вы предоставляете нам лицензию на использование, изменение и распространение вашего контента в приложении.
zh_hans: 您保留对提交到应用程序的任何内容的所有权。通过提交内容，您授予我们在应用程序内使用、修改和分发您内容的许可。

# agreement_section4
source: 4. Termination
es: 4. Terminación
ko: 4. 종료
ru: 4. Прекращение
zh_hans: 4. 终止

# agreement_section4_content
source: We reserve the right to terminate or suspend your access to the service at any time, with or without cause, and with or without notice.
es: Nos reservamos el derecho de terminar o suspender tu acceso al servicio en cualquier momento, con o sin causa, y con o sin aviso.
ko: 사유 여부에 관계없이 사전 통지 없이 언제든지 서비스 액세스를 종료하거나 중단할 권리를 보유합니다.
ru: Мы оставляем за собой право прекратить или приостановить ваш доступ к сервису в любое время, с причиной или без, с уведомлением или без.
zh_hans: 我们保留随时终止或暂停您访问服务的权利，无论是否有原因，也无需事先通知。

# privacy_policy_title
source: Privacy Policy
es: Política de privacidad
ko: 개인정보 처리방침
ru: Политика конфиденциальности
zh_hans: 隐私政策

# privacy_section1
source: 1. Information We Collect
es: 1. Información que recopilamos
ko: 1. 수집하는 정보
ru: 1. Информация, которую мы собираем
zh_hans: 1. 我们收集的信息

# privacy_section1_content
source: We collect information you provide directly to us, such as when you create an account, submit recipes, or contact us for support. This may include your name, email address, and cooking preferences.
es: Recopilamos información que nos proporcionas directamente, como cuando creas una cuenta, envías recetas o nos contactas para soporte. Esto puede incluir tu nombre, dirección de correo electrónico y preferencias culinarias.
ko: 계정 생성, 레시피 제출, 지원 문의 시 등 직접 제공하는 정보를 수집합니다. 여기에는 이름, 이메일 주소, 요리 선호도가 포함될 수 있습니다.
ru: Мы собираем информацию, которую вы предоставляете нам напрямую, например, при создании аккаунта, отправке рецептов или обращении в службу поддержки. Это может включать ваше имя, адрес электронной почты и кулинарные предпочтения.
zh_hans: 我们收集您直接提供给我们的信息，例如当您创建账户、提交食谱或联系我们寻求支持时。这可能包括您的姓名、电子邮件地址和烹饪偏好。

# privacy_section2
source: 2. How We Use Your Information
es: 2. Cómo usamos tu información
ko: 2. 정보 사용 방법
ru: 2. Как мы используем вашу информацию
zh_hans: 2. 我们如何使用您的信息

# privacy_section2_content
source: We use the information we collect to provide, maintain, and improve our services, communicate with you, and personalize your experience within the application.
es: Usamos la información que recopilamos para proporcionar, mantener y mejorar nuestros servicios, comunicarnos contigo y personalizar tu experiencia dentro de la aplicación.
ko: 수집된 정보는 서비스 제공, 유지, 개선, 소통, 애플리케이션 내 경험 개인화에 사용됩니다.
ru: Мы используем собранную информацию для предоставления, поддержания и улучшения наших сервисов, общения с вами и персонализации вашего опыта в приложении.
zh_hans: 我们使用收集的信息来提供、维护和改进我们的服务，与您沟通，并个性化您在应用程序中的体验。

# privacy_section3
source: 3. Information Sharing
es: 3. Compartir información
ko: 3. 정보 공유
ru: 3. Обмен информацией
zh_hans: 3. 信息共享

# privacy_section3_content
source: We do not sell, trade, or otherwise transfer your personal information to third parties without your consent, except as required by law or as necessary to provide our services.
es: No vendemos, intercambiamos o transferimos tu información personal a terceros sin tu consentimiento, excepto cuando sea requerido por ley o necesario para proporcionar nuestros servicios.
ko: 법적 요구사항이나 서비스 제공에 필요한 경우를 제외하고는 동의 없이 제3자에게 개인정보를 판매, 거래 또는 기타 방법으로 전송하지 않습니다.
ru: Мы не продаем, не обмениваем и не передаем вашу личную информацию третьим лицам без вашего согласия, за исключением случаев, требуемых законом или необходимых для предоставления наших услуг.
zh_hans: 未经您的同意，我们不会向第三方出售、交易或以其他方式转让您的个人信息，除非法律要求或为提供我们的服务所必需。

# privacy_section4
source: 4. Data Security
es: 4. Seguridad de datos
ko: 4. 데이터 보안
ru: 4. Безопасность данных
zh_hans: 4. 数据安全

# privacy_section4_content
source: We implement appropriate security measures to protect your personal information against unauthorized access, alteration, disclosure, or destruction.
es: Implementamos medidas de seguridad apropiadas para proteger tu información personal contra acceso no autorizado, alteración, divulgación o destrucción.
ko: 무단 액세스, 변경, 공개 또는 파괴로부터 개인정보를 보호하기 위해 적절한 보안 조치를 구현합니다.
ru: Мы внедряем соответствующие меры безопасности для защиты вашей личной информации от несанкционированного доступа, изменения, раскрытия или уничтожения.
zh_hans: 我们实施适当的安全措施来保护您的个人信息免受未经授权的访问、更改、披露或破坏。

# version_info_title
source: Version Information
es: Información de versión
ko: 버전 정보
ru: Информация о версии
zh_hans: 版本信息

source: Current Version
es: Versión actual
ko: 현재 버전
ru: Текущая версия
zh_hans: 当前版本

source: Build Number
es: Número de compilación
ko: 빌드 번호
ru: Номер сборки
zh_hans: 构建版本

source: Developer
es: Desarrollador
ko: 개발자
ru: Разработчик
zh_hans: 开发者

# legal_info
source: Legal Information
es: Información legal
ko: 법적 정보
ru: Правовая информация
zh_hans: 法律信息

source: Terms of Service
es: Términos de servicio
ko: 서비스 약관
ru: Условия обслуживания
zh_hans: 服务条款

source: Open Source Licenses
es: Licencias de código abierto
ko: 오픈소스 라이선스
ru: Лицензии с открытым исходным кодом
zh_hans: 开源许可证

# support_info
source: Support Information
es: Información de soporte
ko: 지원 정보
ru: Информация поддержки
zh_hans: 支持信息

source: Contact Us
es: Contáctanos
ko: 문의하기
ru: Связаться с нами
zh_hans: 联系我们

source: Rate App
es: Calificar app
ko: 앱 평가
ru: Оценить приложение
zh_hans: 为应用评分

source: Share App
es: Compartir app
ko: 앱 공유
ru: Поделиться приложением
zh_hans: 分享应用

# terms_of_service_content
source: Welcome to HomeCook! By using our application, you agree to comply with the following terms of service: 1. Service Usage HomeCook is a free cooking assistant app designed to help users discover and create delicious recipes. 2. User Responsibilities Users are responsible for their behavior within the app and must not post illegal or inappropriate content. 3. Intellectual Property All content in the app is protected by copyright and may not be copied or distributed without permission. 4. Disclaimer We are not liable for any losses arising from the use of this application. 5. Terms Changes We reserve the right to modify these terms at any time. If you have any questions, please contact our support team.
es: ¡Bienvenido a HomeCook! Al usar nuestra aplicación, aceptas cumplir con los siguientes términos de servicio: 1. Uso del servicio HomeCook es una app gratuita de asistente culinario diseñada para ayudar a los usuarios a descubrir y crear recetas deliciosas. 2. Responsabilidades del usuario Los usuarios son responsables de su comportamiento dentro de la app y no deben publicar contenido ilegal o inapropiado. 3. Propiedad intelectual Todo el contenido en la app está protegido por derechos de autor y no puede ser copiado o distribuido sin permiso. 4. Descargo de responsabilidad No somos responsables de las pérdidas que surjan del uso de esta aplicación. 5. Cambios en los términos Nos reservamos el derecho de modificar estos términos en cualquier momento. Si tienes preguntas, por favor contacta a nuestro equipo de soporte.
ko: HomeCook에 오신 것을 환영합니다! 저희 애플리케이션을 사용함으로써 다음 서비스 약관을 준수하는 것에 동의합니다: 1. 서비스 사용 HomeCook은 사용자가 맛있는 레시피를 발견하고 만드는 것을 돕는 무료 요리 도우미 앱입니다. 2. 사용자 책임 사용자는 앱 내에서의 행동에 책임을 져야 하며, 불법적이거나 부적절한 콘텐츠를 게시해서는 안 됩니다. 3. 지적 재산권 앱 내의 모든 콘텐츠는 저작권으로 보호되며, 허가 없이 복제하거나 배포할 수 없습니다. 4. 면책 조항 본 앱 사용으로 인해 발생한 손실에 대해 저희는 책임을 지지 않습니다. 5. 약관 변경 저희는 언제든지 이 약관을 수정할 권리를 보유합니다. 질문이 있으시면 지원팀에 문의해 주세요.
ru: Добро пожаловать в HomeCook! Используя наше приложение, вы соглашаетесь соблюдать следующие условия обслуживания: 1. Использование сервиса HomeCook - это бесплатное приложение кулинарного помощника, предназначенное для помощи пользователям в открытии и создании вкусных рецептов. 2. Ответственность пользователя Пользователи несут ответственность за свое поведение в приложении и не должны публиковать незаконный или неподходящий контент. 3. Интеллектуальная собственность Весь контент в приложении защищен авторским правом и не может быть скопирован или распространен без разрешения. 4. Отказ от ответственности Мы не несем ответственности за потери, возникающие в результате использования этого приложения. 5. Изменения условий Мы оставляем за собой право изменять эти условия в любое время. Если у вас есть вопросы, пожалуйста, обратитесь к нашей команде поддержки.
zh_hans: 欢迎使用 HomeCook！ 通过使用我们的应用程序，您同意遵守以下服务条款： 1. 服务使用 HomeCook 是一款免费的烹饪助手应用，旨在帮助用户发现和制作美味的食谱。 2. 用户责任 用户需要对自己在应用中的行为负责，不得发布违法或不当内容。 3. 知识产权 应用中的所有内容均受版权保护，未经许可不得复制或分发。 4. 免责声明 我们不对因使用本应用而产生的任何损失承担责任。 5. 条款变更 我们保留随时修改这些条款的权利。 如有疑问，请联系我们的支持团队。
